In [1]:
import pandas as pandu

In [2]:
data = {
    'Name': ['Anuj','Anubhav','Aman','Ankit','Anoop','Alok','Adrash','Ansh'],
    'Age': [23,20,24,22,25,26,21,27],
    'Salary': [40000,54000,60000,65000,45000,80000,87000,67000],
    'Score': [87,98,78,67,86,65,89,88]
}

df = pandu.DataFrame(data)

In [3]:
df

      Name  Age  Salary  Score
0     Anuj   23   40000     87
1  Anubhav   20   54000     98
2     Aman   24   60000     78
3    Ankit   22   65000     67
4    Anoop   25   45000     86
5     Alok   26   80000     65
6   Adrash   21   87000     89
7     Ansh   27   67000     88

In [27]:
df.describe()

            Age        Salary      Score
count   8.00000      8.000000   8.000000
mean   23.50000  62250.000000  82.250000
std     2.44949  16140.012392  11.411147
min    20.00000  40000.000000  65.000000
25%    21.75000  51750.000000  75.250000
50%    23.50000  62500.000000  86.500000
75%    25.25000  70250.000000  88.250000
max    27.00000  87000.000000  98.000000

In [5]:
df.shape

(8, 4)

In [8]:
df.columns

Index(['Name', 'Age', 'Salary', 'Score'], dtype='object')

In [20]:
df['Name']

0       Anuj
1    Anubhav
2       Aman
3      Ankit
4      Anoop
5       Alok
6     Adrash
7       Ansh
Name: Name, dtype: object

In [25]:
print(df[['Name','Age']])

      Name  Age
0     Anuj   23
1  Anubhav   20
2     Aman   24
3    Ankit   22
4    Anoop   25
5     Alok   26
6   Adrash   21
7     Ansh   27

In [15]:
print(df['Salary']>50000)

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: Salary, dtype: bool

In [17]:
df[df['Salary']>50000]

      Name  Age  Salary  Score
1  Anubhav   20   54000     98
2     Aman   24   60000     78
3    Ankit   22   65000     67
5     Alok   26   80000     65
6   Adrash   21   87000     89
7     Ansh   27   67000     88

In [19]:
df[(df['Salary']>50000) & (df['Age']>25)]

   Name  Age  Salary  Score
5  Alok   26   80000     65
7  Ansh   27   67000     88

In [31]:
df[(df['Age']>25 | (df['Score']>90))]

      Name  Age  Salary  Score
0     Anuj   23   40000     87
1  Anubhav   20   54000     98
2     Aman   24   60000     78
3    Ankit   22   65000     67
4    Anoop   25   45000     86
5     Alok   26   80000     65
6   Adrash   21   87000     89
7     Ansh   27   67000     88